Revit 2026 API

# FileExportedEventArgs Properties

---

The FileExportedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BackgroundOperation | Identifies whether the event belongs to a background export operation. |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPostDocEventArgs) |
|  | Format | Identifies the export format, e.g. DWG or image. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Path | Target path for the exported file (or files). |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). (Inherited from RevitAPIPostEventArgs) |

#### Reference

FileExportedEventArgs Class

Autodesk.Revit.DB.Events Namespace